[
    {
        "Unique ID": 1079613,
        "Product_Name": "Napoleon Perdis Camera Finish Concealer - DY22",
        "Product_URL": "https://www.adorebeauty.com.au/p/napoleon-perdis/napoleon-perdis-camera-finish-concealer.html?child_product_id=74417",
        "Product_In_Stock": "Available",
        "Product_Price": 32.0,
        "Product_Colour": "DY22 - Dark/yellow",
        "Product_Size": NaN,
        "Category": NaN,
        "Product_Image_URL": "https://www.adorebeauty.com.au/pim_media/000/393/020/Napoleon_Perdis_Camera_Finish_Concealer_-_DY22_%2832845%29_Hero.png?1631719192",
        "Product_Tags": NaN,
        "Hair Concern": NaN,
        "Hair Curl Type": NaN,
        "Hair Texture": NaN,
        "Hair Type": NaN,
        "Skin Concern": NaN,
        "Skin Type": NaN,
        "Age": NaN,
        "full_description": "Get second skin comfort and smooth, creamy coverage with Napoleon Perdis Camera Finish Concealer. Ideal to use under the eyes or anywhere on the face, this concealer minimises dark circles, redness and discolouration. It offers medium-to-full coverage and a soft focus, natural matte finish, for flawless skin that still looks real.Why will I love Napoleon Perdis Camera Finish Concealer?Creamy concealerNatural matte finishMedium to full coverageUse under the eyes or anywhere on the face&nbsp;&nbsp;Contains Vitamin E to help protect and nourish skinParaben-freeVegan4mlNapoleon Perdis Camera Finish Concealer features a creamy, ultra-blendable formula. Enriched with antioxidant Vitamin E, it helps keep skin feeling comfortable and hydrated. It's suited to all skin types, and the range includes a corrective shade designed for under-eye discolouration in medium to deep skin tones.How do I apply Napoleon Perdis Camera Finish Concealer?Use the included applicator to apply a small amount of concealer under the eyes, around the nose or anywhere you want some extra coverage.Dampen a makeup sponge and gently pat to blend concealer.For fuller coverage, diffuse concealer with a sponge, or blend with a brush for a lighter finish.Shade CPC27 is a corrective, pink-toned shade designed to neutralise under-eye discolouration in medium to deep skin tones. Apply and blend a small amount on any areas of discolouration, and follow with the shade that matches your skin tone.&nbsp;&nbsp;",
        "how_to_use": NaN,
        "ingredients": NaN,
        "sub_category": "[\"/default/specials\", \"/default/make-up\", \"/default/specials/adore-frenzy\", \"default/specials/adore-frenzy/makeup\", \"/default/trending-beauty/mardi-gras\"]",
        "eye_concern": NaN,
        "product type": NaN
    },
    {
        "Unique ID": 1079615,
        "Product_Name": "Napoleon Perdis Camera Finish Concealer - DN20",
        "Product_URL": "https://www.adorebeauty.com.au/p/napoleon-perdis/napoleon-perdis-camera-finish-concealer.html?child_product_id=74424",
        "Product_In_Stock": "Available",
        "Product_Price": 32.0,
        "Product_Colour": "DN20 - Dark/neutral",
        "Product_Size": NaN,
        "Category": NaN,
        "Product_Image_URL": "https://www.adorebeauty.com.au/pim_media/000/393/016/Napoleon_Perdis_Camera_Finish_Concealer_-_DN20_%2832843%29_Hero.png?1631717942",
        "Product_Tags": NaN,
        "Hair Concern": NaN,
        "Hair Curl Type": NaN,
        "Hair Texture": NaN,
        "Hair Type": NaN,
        "Skin Concern": NaN,
        "Skin Type": NaN,
        "Age": NaN,
        "full_description": "Get second skin comfort and smooth, creamy coverage with Napoleon Perdis Camera Finish Concealer. Ideal to use under the eyes or anywhere on the face, this concealer minimises dark circles, redness and discolouration. It offers medium-to-full coverage and a soft focus, natural matte finish, for flawless skin that still looks real.Why will I love Napoleon Perdis Camera Finish Concealer?Creamy concealerNatural matte finishMedium to full coverageUse under the eyes or anywhere on the face&nbsp;&nbsp;Contains Vitamin E to help protect and nourish skinParaben-freeVegan4mlNapoleon Perdis Camera Finish Concealer features a creamy, ultra-blendable formula. Enriched with antioxidant Vitamin E, it helps keep skin feeling comfortable and hydrated. It's suited to all skin types, and the range includes a corrective shade designed for under-eye discolouration in medium to deep skin tones.How do I apply Napoleon Perdis Camera Finish Concealer?Use the included applicator to apply a small amount of concealer under the eyes, around the nose or anywhere you want some extra coverage.Dampen a makeup sponge and gently pat to blend concealer.For fuller coverage, diffuse concealer with a sponge, or blend with a brush for a lighter finish.Shade CPC27 is a corrective, pink-toned shade designed to neutralise under-eye discolouration in medium to deep skin tones. Apply and blend a small amount on any areas of discolouration, and follow with the shade that matches your skin tone.&nbsp;&nbsp;",
        "how_to_use": NaN,
        "ingredients": NaN,
        "sub_category": "[\"/default/specials\", \"/default/make-up\", \"/default/specials/adore-frenzy\", \"default/specials/adore-frenzy/makeup\", \"/default/trending-beauty/mardi-gras\"]",
        "eye_concern": NaN,
        "product type": NaN
    },
    {
        "Unique ID": 1151618,
        "Product_Name": "Benefit Boi-ing Bright on Concealer - shade 14 - Clove",
        "Product_URL": "https://www.adorebeauty.com.au/p/benefit-cosmetics/benefit-boi-ing-bright-on-concealer.html?child_product_id=78348",
        "Product_In_Stock": "Available",
        "Product_Price": 40.0,
        "Product_Colour": "14 Clove - deepest tan-peach for deep red undereye discoloration",
        "Product_Size": NaN,
        "Category": NaN,
        "Product_Image_URL": "https://www.adorebeauty.com.au/pim_media/000/526/723/FM269_1.png?1739425787",
        "Product_Tags": NaN,
        "Hair Concern": NaN,
        "Hair Curl Type": NaN,
        "Hair Texture": NaN,
        "Hair Type": NaN,
        "Skin Concern": NaN,
        "Skin Type": NaN,
        "Age": NaN,
        "full_description": "Banish dark circles and bring on the brightness with Benefit Boi-ing Bright On Concealer. Blending the best of makeup and skincare, this creamy concealer targets dullness, dark circles and dryness - talk about a triple threat! Red algae extract and a vitamin C derivative help visibly brighten skin, while colour-correcting pigments neutralise dark circles, and the serum-like texture seals in moisture.&nbsp; &nbsp;&nbsp;Why will I love Benefit Boi-ing Bright On Concealer?Under-eye concealerHelps brighten, colour-correct and hydrate skinBuildable, luminous coverageLasts up to 8 hours*Lightweight, silky formulaColour-correcting pigments minimise dark circles&nbsp; &nbsp; &nbsp;Hydrating serum-like textureWater-resistantFormulated with red algae extract and vitamin C derivativePair with Boi-ing Cakeless Concealer for a full coverage finish94% said finish is luminous**95% said skin looks soft &amp; supple**Lightweight and comfortable to wear, Benefit Bright On Concealer has buildable coverage and a luminous finish, and lasts up to 8 hours*.Discover the Benefit dream team - Boi-ing Bright On Concealer pairs perfectly with Boi-ing Cakeless Concealer, for a full coverage, skin-brightening finish.*instrumental test on 20 participants**self-evaluation by 103 participants after 1 weekHow do I apply Benefit Boi-ing Bright On Concealer?Apply three small dots of concealer to each undereye using the doe foot applicator. Gently blend using your fingertip, from the inner corner towards the outer corner. Layer for additional brightening and touch up throughout the day if needed.Beauty Tip:Dot &amp; blend Boi-ing Bright On Concealer on cheekbones &amp; bridge of nose for a brightening boost.What shade should I wear?If you usually wear a fair or light concealer, or Boi-ing Cakeless Concealer in any shade between 0.5 All Good (fairest cool) and 5 Feel Good (light warm), try Lychee, Nectarine or Cantaloupe.If you usually wear a medium to tan concealer, or Boi-ing Cakeless Concealer in any shade between 6 Fly High (medium cool) and 9.25 Pep Talk (tan golden), try Melon, Ginger, Peach, Almond or Apricot.If you usually wear a deep/dark concealer, or Boi-ing Cakeless Concealer in any shade between 9.5 Power Up (deep neutral) and 17 Your Way (deepest-dark warm), try Nutmeg, Walnut, Hazelnut or Clove.",
        "how_to_use": NaN,
        "ingredients": NaN,
        "sub_category": "[\"/default/make-up\", \"/default/specials/adore-frenzy\", \"default/specials/adore-frenzy/makeup\", \"/default/trending-beauty/mardi-gras\"]",
        "eye_concern": NaN,
        "product type": NaN
    },
    {
        "Unique ID": 1153257,
        "Product_Name": "Napoleon Perdis Shine Show Liquid Lipstick - Buffy",
        "Product_URL": "https://www.adorebeauty.com.au/p/napoleon-perdis/napoleon-perdis-shine-show-liquid-lipstick.html?child_product_id=78794",
        "Product_In_Stock": "Available",
        "Product_Price": 37.6,
        "Product_Colour": "Buffy",
        "Product_Size": NaN,
        "Category": NaN,
        "Product_Image_URL": "https://www.adorebeauty.com.au/pim_media/000/402/596/Napoleon_Perdis_Shine_Show_Liquid_Lipstick_-_Brandy_1024.png?1644892248",
        "Product_Tags": NaN,
        "Hair Concern": NaN,
        "Hair Curl Type": NaN,
        "Hair Texture": NaN,
        "Hair Type": NaN,
        "Skin Concern": NaN,
        "Skin Type": NaN,
        "Age": NaN,
        "full_description": "Get the best of both worlds with Napoleon Perdis Shine Show Liquid Lipstick. With the extended wear time of a lipstick and the high-shine finish of a gloss, it's a makeup bag must-have.&nbsp;The creamy formula easily glides onto lips, and features a cushiony texture that leaves lips soft and hydrated.&nbsp;Why will I love Napoleon Perdis Shine Show Liquid Lipstick?Liquid lipstick with a glossy finishLong-wearingComfortable, creamy formulaAvailable in a range of wearable 90s-inspired shadesGluten-, oil-, and preservative-freeVegan8.5mlHow do I apply Napoleon Perdis Shine Show Liquid Lipstick?For ultimate colour payoff, apply directly to lips with the applicator or a lip brush, starting at the outer corner and working inwards.For a softer, sheerer finish, dab a small amount onto the lips and blend with a fingertip.Pro tips:Prepare lips with Audot Pilot Lip Service or pH Lip Shine for a smooth, hydrated surface.For extra precision, outline the shape of your lips with Napoleon Taking Shape Lip Liner before applying liquid lipstick.&nbsp;&nbsp;",
        "how_to_use": NaN,
        "ingredients": NaN,
        "sub_category": "[\"/default/specials\", \"/default/make-up\", \"/default/specials/adore-frenzy\", \"default/specials/adore-frenzy/makeup\", \"/default/trending-beauty/mardi-gras\"]",
        "eye_concern": NaN,
        "product type": NaN
    },
    {
        "Unique ID": 1179022,
        "Product_Name": "MAKE UP FOR EVER HD SKIN FOUNDATION 30ml - 3N42",
        "Product_URL": "https://www.adorebeauty.com.au/p/make-up-for-ever/make-up-for-ever-hd-skin-foundation.html?child_product_id=79945",
        "Product_In_Stock": "Available",
        "Product_Price": 55.5,
        "Product_Colour": "3N42 Amber - for medium to tan skin tones with neutral undertones",
        "Product_Size": NaN,
        "Category": NaN,
        "Product_Image_URL": "https://www.adorebeauty.com.au/pim_media/000/404/535/MAKE_UP_FOR_EVER_HD_Skin_Foundation__1024.png?1647407618",
        "Product_Tags": NaN,
        "Hair Concern": NaN,
        "Hair Curl Type": NaN,
        "Hair Texture": NaN,
        "Hair Type": NaN,
        "Skin Concern": NaN,
        "Skin Type": NaN,
        "Age": NaN,
        "full_description": "Give skin an undetectable finish that lasts day and night, with MAKE UP FOR EVER HD Skin Foundation. Building on the best-selling Ultra HD Foundation formula, this new and improved version features a natural finish and medium to full coverage that won't cake or settle on skin. It wears for up to 24 hours, with a true-to-skin finish that blurs and minimises imperfections.&nbsp;Why will I love MAKE UP FOR EVER HD Skin Foundation?Long-wearing liquid foundationNew and improved formulaNatural finishMedium to full coverageTrue-to-skin finish24 hour wear timeWon't cake or settleRecyclable glass bottleSweat- and water-resistantNon-comedogenicVegan30mlMAKE UP FOR EVER HD Skin Foundation features an ultra-versatile formula that can be customised with your favourite MAKE UP FOR EVER complexion products, including Mist &amp; Fix Setting Spray, Ultra HD Powder and the Step 1 Primer range.How do I apply MAKE UP FOR EVER HD Skin Foundation?MAKE UP FOR EVER HD Skin Foundation can be easily customised to your preferred finish. Shake bottle well before use for best results.For sheer coverage, apply directly to skin with fingertips, starting at the centre of the face and blending outwards.For medium coverage, apply one pump of HD Skin to the back of your hand, or directly onto a brush (we like Make Up For Ever's #109 HD Skin Foundation Brush). Start applying from the middle of the face, blending and stretching outwards until you reach your desired coverage.For additional coverage, apply one pump to the back of your hand and apply with a damp sponge - the HD Skin Foundation Sponge works a treat. Lightly tap and stretch the foundation onto your face, adding extra coverage wherever needed.For a glowing, radiant finish, mix in a drop of your favourite face oil and apply with a tapping motion.Give skin a satin look by prepping skin with Mist &amp; Fix, then following with HD Skin Foundation applied with a damp sponge.",
        "how_to_use": NaN,
        "ingredients": NaN,
        "sub_category": "[\"/default/make-up\", \"/default/specials/adore-frenzy\", \"default/specials/adore-frenzy/makeup\", \"/default/adore-subscribe-and-save\", \"/default/trending-beauty/mardi-gras\"]",
        "eye_concern": NaN,
        "product type": NaN
    },
    {
        "Unique ID": 1195964,
        "Product_Name": "Trudon Cire Candle 3kg",
        "Product_URL": "https://www.adorebeauty.com.au/p/trudon/trudon-cire-candle-3kg.html",
        "Product_In_Stock": "Available",
        "Product_Price": 930.0,
        "Product_Colour": NaN,
        "Product_Size": "3kg",
        "Category": NaN,
        "Product_Image_URL": "https://www.adorebeauty.com.au/pim_media/000/413/008/Trudon_Cire_Candle_3kg_1024.png?1660090518",
        "Product_Tags": NaN,
        "Hair Concern": NaN,
        "Hair Curl Type": NaN,
        "Hair Texture": NaN,
        "Hair Type": NaN,
        "Skin Concern": NaN,
        "Skin Type": NaN,
        "Age": NaN,
        "full_description": "Deo regique laborant - they work for God and King. Trudon Cire Classic Candle celebrates the humble bee, an integral part of the Maison's history and emblazoned on every candle and box. Scented with warm waxed wood and beeswax absolute, this candle is an ode to the centuries of craftsmanship, and the vitally important creatures that make it possible.What are the notes in Trudon Cire Candle?Head: Bergamot. Waxed Wood. Honey.Heart: Beeswax Absolute. Sandalwood essential oil. Cinnamon essential oil.Base: Tonka Bean. Patchouli essential oil. Musk. Vanilla.Why will I love Trudon Cire Candle 3kg?Burn time of over 300 hoursVegetable wax based candleSmoke free burnArtisanal glass, crafted by hand in Vinci, ItalyCotton wick adapted to each fragranceGreat style candle, 21.5cm height and 18cm diameter3kg&nbsp;Cire Trudon: Candles With HistoryOnce, every royal palace would have a team of staff to care for candles. Founded in 1643, Maison de Cire Trudon crafted candles for the royal court of Versailles. Cire Trudon candles still carry the emblem of King Louis XIV who created the Royal Wax Manufacture in Antony, which once belonged to the Cire Trudon family. With a gold seal inspired by a bas relief on the Royal Wax Manufacture, the Cire Trudon motto is a tribute to the bees that contributed to the Maison Trudon candles throughout the centuries. Though Cire Trudon candles are now made with a more environmentally friendly vegetable wax, you can still read the Latin deo regique laborant” which refers to bees “doing work for god and king.”&nbsp;How do I care for my Cire Trudon candles?The first time you light your Cire Trudon candle is the most important. Ensure that you leave your candle on until the surface is completely liquid - if the wax is still solid towards the edges, the candle will create a tunnel rather than burning smoothly throughout its life span. Do not allow candle to burn longer than 3 hours.If the wick shifts, reposition it while the wax is still warm, but not hot.When the candle cools, protect its surface with a bell jar or cloche to prevent dust build up.Never leave your candle unattended. Keep candles away from pets and children, and away from draughts and curtains. Protect the surface you burn your candle on with a wooden base or small plate.",
        "how_to_use": "How do I care for my Cire Trudon candles?The first time you light your Cire Trudon candle is the most important. Ensure that you leave your candle on until the surface is completely liquid - if the wax is still solid towards the edges, the candle will create a tunnel rather than burning smoothly throughout its life span. Do not allow candle to burn longer than 3 hours. If the wick shifts, reposition it while the wax is still warm, but not hot.When the candle cools, protect its surface with a bell jar or cloche to prevent dust build up.Never leave your candle unattended. Keep candles away from pets and children, and away from draughts and curtains. Protect the surface you burn your candle on with a wooden base or small plate.",
        "ingredients": NaN,
        "sub_category": "[\"/default/gifts\", \"/default/gifts/candle-gift-ideas\", \"/default/gifts/by-budget\", \"default/gifts/by-budget/over-100\", \"/default/cire-trudon\", \"default/cire-trudon/candles\", \"/default/specials\", \"/default/fragrance\", \"/default/fragrance/home-fragrance\", \"default/fragrance/home-fragrance/candles\", \"/default/specials/offers\"]",
        "eye_concern": NaN,
        "product type": NaN
    },
    {
        "Unique ID": 1195962,
        "Product_Name": "Trudon Josephine Candle 800g",
        "Product_URL": "https://www.adorebeauty.com.au/p/trudon/trudon-josephine-candle-800g.html",
        "Product_In_Stock": "Available",
        "Product_Price": 440.0,
        "Product_Colour": NaN,
        "Product_Size": "800g",
        "Category": NaN,
        "Product_Image_URL": "https://www.adorebeauty.com.au/pim_media/000/412/843/Trudon_Josephine_Candle_800g_1024.png?1659935735",
        "Product_Tags": NaN,
        "Hair Concern": NaN,
        "Hair Curl Type": NaN,
        "Hair Texture": NaN,
        "Hair Type": NaN,
        "Skin Concern": NaN,
        "Skin Type": NaN,
        "Age": NaN,
        "full_description": "“Josephine wins hearts.” Empress Josephine was the consummate host, known for her style, political acumen, and - who could forget - parties during her husband's reign. But, she was also well known for her passion for botany, with greenhouses full of rare plants and roses. Cire Trudon have recreated the sumptuous fragrances that would have completed the experience for Josephine's distinguished guests.&nbsp;What are the notes of Cire Trudon Josephine Candle?Head: Bergamot. Kaffir Lime. Spices.Heart: Chinese Camellia. Egyptian Jasmine. Turkish Rose.Base: Indonesian Sandalwood. Iris. White Musk.&nbsp;What are the features &amp; benefits of Cire Trudon Josephine Intermezzo Candle?&nbsp;Burn time of 110-120 hours.Vegetable wax based candleSmoke free burnArtisanal glass, crafted by hand in Vinci, ItalyCotton wick adapted to each fragranceIntermezzo style candle, 16cm height and 13.5cm diameter&nbsp;Cire Trudon: Candles With HistoryOnce, every royal palace would have a team of staff to care for candles. Founded in 1643, Maison de Cire Trudon crafted candles for the royal court of Versailles. Cire Trudon candles still carry the emblem of King Louis XIV who created the Royal Wax Manufacture in Antony, which once belonged to the Cire Trudon family. With a gold seal inspired by a bas relief on the Royal Wax Manufacture, the Cire Trudon motto is a tribute to the bees that contributed to the Maison Trudon candles throughout the centuries. Though Cire Trudon candles are now made with a more environmentally friendly vegetable wax, you can still read the latin deo regique laborant” which refers to bees “doing work for god and king.”&nbsp;How do I care for my Cire Trudon candles?The first time you light your Cire Trudon candle is the most important. Ensure that you leave your candle on until the surface is completely liquid - if the wax is still solid towards the edges, the candle will create a tunnel rather than burning smoothly throughout its life span. Do not allow candle to burn longer than 3 hours.If the wick shifts, reposition it while the wax is still warm, but not hot.When the candle cools, protect its surface with a bell jar or cloche to prevent dust build up.Never leave your candle unattended. Keep candles away from pets and children, and away from draughts and curtains. Protect the surface you burn your candle on with a wooden base or small plate.",
        "how_to_use": "How do I care for my Cire Trudon candles?The first time you light your Cire Trudon candle is the most important. Ensure that you leave your candle on until the surface is completely liquid - if the wax is still solid towards the edges, the candle will create a tunnel rather than burning smoothly throughout its life span. Do not allow candle to burn longer than 3 hours. If the wick shifts, reposition it while the wax is still warm, but not hot.When the candle cools, protect its surface with a bell jar or cloche to prevent dust build up.Never leave your candle unattended. Keep candles away from pets and children, and away from draughts and curtains. Protect the surface you burn your candle on with a wooden base or small plate.",
        "ingredients": NaN,
        "sub_category": "[\"/default/gifts\", \"/default/gifts/candle-gift-ideas\", \"/default/gifts/by-budget\", \"default/gifts/by-budget/over-100\", \"/default/cire-trudon\", \"default/cire-trudon/candles\", \"/default/specials\", \"/default/fragrance\", \"/default/fragrance/home-fragrance\", \"default/fragrance/home-fragrance/candles\", \"/default/specials/offers\"]",
        "eye_concern": NaN,
        "product type": NaN
    },
    {
        "Unique ID": 1202689,
        "Product_Name": "Huda Beauty #Fauxfilter Luminous Matte Liquid Concealer Crumble 7.1 9ml",
        "Product_URL": "https://www.adorebeauty.com.au/p/huda-beauty/huda-beauty-fauxfilter-luminous-matte-liquid-concealer.html?child_product_id=86256",
        "Product_In_Stock": "Available",
        "Product_Price": 42.4,
        "Product_Colour": "7.1 Crumble",
        "Product_Size": NaN,
        "Category": NaN,
        "Product_Image_URL": "https://www.adorebeauty.com.au/pim_media/000/414/288/Huda_Beauty__Fauxfilter_Luminous_Matte_Liquid_Concealer_1024.png?1661842685",
        "Product_Tags": NaN,
        "Hair Concern": NaN,
        "Hair Curl Type": NaN,
        "Hair Texture": NaN,
        "Hair Type": NaN,
        "Skin Concern": NaN,
        "Skin Type": NaN,
        "Age": NaN,
        "full_description": "For flexible coverage and a long-wear finish that moves with you, we love Huda Beauty #FauxFilter Luminous Matte Liquid Concealer. Combining a lightweight and creamy feel with medium to full coverage, this concealer is ideal for minimising the look of dark circles, redness and blemishes.&nbsp;Why will I love Huda Beauty #FauxFilter Luminous Matte Liquid Concealer?Long-wearing liquid concealerMedium to full coverageLuminous matte finishIdeal for the face and under-eyesConceals, brightens and blursReduces the look of dark circles, blemishes and rednessAvailable in 29 shadesWears for 14 hours without creasingNo flashbackLarge doefoot applicatorContains Vitamin E and Sweet Almond OilWaterproof, sweat-proof and transfer-proofNon-comedogenicFragrance-free, alcohol-freeVegan and cruelty-free9mlHuda Faux Filter Concealer is designed to last - that means waterproof, sweat-proof and transfer-proof, and offers up to 14 hours of crease-proof wear. It's also photography-friendly with zero flashback, and the sweet almond oil and vitamin E-infused formula feels comfortable and nourishing on skin.How do I use Huda Beauty #FauxFilter Luminous Matte Liquid Concealer?Apply a small amount to the desired area, and blend with a brush or damp sponge.Repeat for more coverage.Huda's hacks:Apply a brighter shade lightly under eyes to brighten and refresh. Then to conceal, apply a concealing shade under contour, on nose, chin and under brows for a polished, lifted look.",
        "how_to_use": NaN,
        "ingredients": NaN,
        "sub_category": "[\"/default/make-up\", \"/default/specials/adore-frenzy\", \"default/specials/adore-frenzy/makeup\", \"/default/trending-beauty/mardi-gras\"]",
        "eye_concern": NaN,
        "product type": NaN
    },
    {
        "Unique ID": 1202747,
        "Product_Name": "Huda Beauty #FauxFilter Luminous Matte Liquid Foundation 410G Brown Sugar 35ml",
        "Product_URL": "https://www.adorebeauty.com.au/p/huda-beauty/huda-beauty-fauxfilter-luminous-matte-liquid-foundation.html?child_product_id=86261",
        "Product_In_Stock": "Available",
        "Product_Price": 57.6,
        "Product_Colour": "410G Brown Sugar - Medium-tan skin with an olive-gold undertone",
        "Product_Size": NaN,
        "Category": NaN,
        "Product_Image_URL": "https://www.adorebeauty.com.au/pim_media/000/414/265/Huda_Beauty__FauxFilter_Luminous_Matte_Liquid_Foundation_35ml_1024.png?1661840802",
        "Product_Tags": NaN,
        "Hair Concern": NaN,
        "Hair Curl Type": NaN,
        "Hair Texture": NaN,
        "Hair Type": NaN,
        "Skin Concern": NaN,
        "Skin Type": NaN,
        "Age": NaN,
        "full_description": "Get the best of both worlds with Huda Beauty #FauxFilter Foundation. This cult favourite foundation is matte yet luminous, with a skin-blurring finish that won't look or feel cakey. It features full yet flexible coverage that instantly evens out skin tone and minimises the look of imperfections.Why will I love Huda Beauty #FauxFilter Luminous Matte Foundation?Long-wearing liquid foundationFull coverageLuminous matte finishFor all skin typesAvailable in 39 shades across 8 colour familiesWears for up to 24 hoursNon-comedogenicWaterproof, transfer-proof, fade-proof, sweat-proof, humidity-proofFragrance-freeVegan and cruelty-free35mlHuda Beauty Faux Filter Foundation wears for up to 24 hours, and lasts through whatever life throws your way - that's waterproof, transfer-proof, fade-proof, sweat-proof and humidity-proof. Phew! We need to take a breath after all that, but your foundation won't.How do I apply Huda Beauty Faux Filter Foundation?Using 1-2 pumps, apply foundation evenly over the face, using a dense brush or beauty sponge to blend.",
        "how_to_use": NaN,
        "ingredients": NaN,
        "sub_category": "[\"/default/make-up\", \"/default/specials/adore-frenzy\", \"default/specials/adore-frenzy/makeup\", \"/default/trending-beauty/mardi-gras\"]",
        "eye_concern": NaN,
        "product type": NaN
    },
    {
        "Unique ID": 1202737,
        "Product_Name": "Huda Beauty Lip Contour 2.0 Universal Red 0.5g",
        "Product_URL": "https://www.adorebeauty.com.au/p/huda-beauty/huda-beauty-lip-contour.html?child_product_id=86279",
        "Product_In_Stock": "Available",
        "Product_Price": 28.8,
        "Product_Colour": "Universal Red",
        "Product_Size": NaN,
        "Category": NaN,
        "Product_Image_URL": "https://www.adorebeauty.com.au/pim_media/000/414/255/Huda_Beauty_Lip_Contour_2.0_1024.png?1661836472",
        "Product_Tags": NaN,
        "Hair Concern": NaN,
        "Hair Curl Type": NaN,
        "Hair Texture": NaN,
        "Hair Type": NaN,
        "Skin Concern": NaN,
        "Skin Type": NaN,
        "Age": NaN,
        "full_description": "Discover the dreamy, creamy feel of Huda Beauty Lip Contour 2.0. Even better than Huda's original formula, this reinvented lip pencil combines the rich pigmentation you expect with a soft and smooth texture that effortlessly glides onto lips. Both lightweight and long-wearing, this lip liner is designed to last, and the twist up design, retractable tip and built-in mini sharpener make it oh so handbag-friendly.Why will I love Huda Beauty Lip Contour 2.0?Highly pigmented lip pencilAvailable in 12 universal shadesMatte finishLong-wearingSmooth, creamy textureTwist up design and retractable tipIncludes a built-in sharpenerWaterproofVegan and cruelty-free0.5gWith a buttery soft feel and ultra pigmented matte finish, Huda Beauty Lip Contour 2.0 is perfect for sculpting a plumper-looking pout. Wear it alone, or top with liquid lipstick, lipstick or gloss for the ultimate in high-impact lips.12 shades, including best-sellers Terracotta, Warm Brown, and Honey Beige, are designed to suit a wide range of skin tones and match any lip look.How to use Huda Beauty Lip Contour 2.0Start by drawing an X shape on your cupid's bow to create the arch, then line the bottom centre of your lips.Connect the line at the corners to create a full lip liner - if you overline a little, go slow and build up.Fill in with lipstick or gloss.How to sharpen Huda Beauty Lip Contour 2.0This lip pencil includes a super-handy mini sharpener built in - simply remove the cap at the base of the pencil and gently sharpen for smooth, precise lines.",
        "how_to_use": NaN,
        "ingredients": NaN,
        "sub_category": "[\"/default/make-up\", \"/default/specials/adore-frenzy\", \"default/specials/adore-frenzy/makeup\", \"/default/trending-beauty/mardi-gras\"]",
        "eye_concern": NaN,
        "product type": NaN
    },
    {
        "Unique ID": 1203002,
        "Product_Name": "Bobbi Brown Skin Full Cover Concealer - Warm Sand",
        "Product_URL": "https://www.adorebeauty.com.au/p/bobbi-brown/bobbi-brown-skin-full-cover-concealer.html?child_product_id=86317",
        "Product_In_Stock": "Available",
        "Product_Price": 48.0,
        "Product_Colour": "Warm Sand - Very light beige with yellow undertones; for very light skin",
        "Product_Size": NaN,
        "Category": NaN,
        "Product_Image_URL": "https://www.adorebeauty.com.au/pim_media/000/415/315/Bobbi_Brown_Skin_Full_Cover_Concealer_1.png?1662422516",
        "Product_Tags": NaN,
        "Hair Concern": NaN,
        "Hair Curl Type": NaN,
        "Hair Texture": NaN,
        "Hair Type": NaN,
        "Skin Concern": NaN,
        "Skin Type": NaN,
        "Age": NaN,
        "full_description": "Full coverage and a featherweight finish - now that's the dream team. Introducing Bobbi Brown Skin Full Cover Concealer, a long-lasting, skin-perfecting concealer that won't crease or settle. Formulated with flexible film formers plus hyaluronic acid, this long-wear concealer feels ultra-comfortable on skin, and wears for up to 16 hours.Why will I love Bobbi Brown Skin Full Cover Concealer?Full coverage foundationUltra-lightweight, comfortable feelIdeal for face and under-eyesUp to 16 hours of wearWon't crease or settleFlexible formula for a seamless look and feelHyaluronic acid smooths and hydratesParaben-free, phthalate-free8mlDesigned to be used under the eyes or anywhere on the face, Bobbi Brown Skin Full Cover Concealer minimises the look of dark circles, blemishes, redness and other imperfections. It leaves skin looking fresh and even, with 23 skin-true, undertone-correct shades.How do I use Bobbi Brown Skin Full Cover Concealer?Use the tapered tip to swipe from the inner corners of the eyes to just beyond the under-eyes, or dot onto blemishes or other imperfections. Gently tap to blend.For stubborn dark circles, layer concealer over Bobbi Brown Corrector.",
        "how_to_use": NaN,
        "ingredients": NaN,
        "sub_category": "[\"/default/make-up\", \"/default/specials/adore-frenzy\", \"default/specials/adore-frenzy/makeup\"]",
        "eye_concern": NaN,
        "product type": NaN
    },
    {
        "Unique ID": 1202999,
        "Product_Name": "Bobbi Brown Skin Full Cover Concealer - Espresso",
        "Product_URL": "https://www.adorebeauty.com.au/p/bobbi-brown/bobbi-brown-skin-full-cover-concealer.html?child_product_id=86344",
        "Product_In_Stock": "Available",
        "Product_Price": 48.0,
        "Product_Colour": "Espresso - Deepest brown with red/brown/yellow undertones; for the deepest skin",
        "Product_Size": NaN,
        "Category": NaN,
        "Product_Image_URL": "https://www.adorebeauty.com.au/pim_media/000/415/315/Bobbi_Brown_Skin_Full_Cover_Concealer_1.png?1662422516",
        "Product_Tags": NaN,
        "Hair Concern": NaN,
        "Hair Curl Type": NaN,
        "Hair Texture": NaN,
        "Hair Type": NaN,
        "Skin Concern": NaN,
        "Skin Type": NaN,
        "Age": NaN,
        "full_description": "Full coverage and a featherweight finish - now that's the dream team. Introducing Bobbi Brown Skin Full Cover Concealer, a long-lasting, skin-perfecting concealer that won't crease or settle. Formulated with flexible film formers plus hyaluronic acid, this long-wear concealer feels ultra-comfortable on skin, and wears for up to 16 hours.Why will I love Bobbi Brown Skin Full Cover Concealer?Full coverage foundationUltra-lightweight, comfortable feelIdeal for face and under-eyesUp to 16 hours of wearWon't crease or settleFlexible formula for a seamless look and feelHyaluronic acid smooths and hydratesParaben-free, phthalate-free8mlDesigned to be used under the eyes or anywhere on the face, Bobbi Brown Skin Full Cover Concealer minimises the look of dark circles, blemishes, redness and other imperfections. It leaves skin looking fresh and even, with 23 skin-true, undertone-correct shades.How do I use Bobbi Brown Skin Full Cover Concealer?Use the tapered tip to swipe from the inner corners of the eyes to just beyond the under-eyes, or dot onto blemishes or other imperfections. Gently tap to blend.For stubborn dark circles, layer concealer over Bobbi Brown Corrector.",
        "how_to_use": NaN,
        "ingredients": NaN,
        "sub_category": "[\"/default/make-up\", \"/default/specials/adore-frenzy\", \"default/specials/adore-frenzy/makeup\"]",
        "eye_concern": NaN,
        "product type": NaN
    }
]